atomvm/AtomVM/src/platforms/esp32/components/avm_sys/sys.c
    platform->entropy_mutex = smp_mutex_create();
    if (IS_NULL_PTR(platform->entropy_mutex)) {
        AVM_ABORT();
    }
    platform->random_mutex = smp_mutex_create();
    if (IS_NULL_PTR(platform->random_mutex)) {
        AVM_ABORT();
    }
#endif

    platform->entropy_is_initialized = false;
    platform->random_is_initialized = false;

    ErlNifResourceFlags flags;
    ErlNifEnv env;
    erl_nif_env_partial_init_from_globalcontext(&env, glb);
    platform->partition_mmap_resource_type = enif_init_resource_type(&env, "partition_mmap", &partition_mmap_resource_type_init, ERL_NIF_RT_CREATE, &flags);
    if (UNLIKELY(flags != ERL_NIF_RT_CREATE)) {
        AVM_ABORT();
    }
    if (IS_NULL_PTR(platform->partition_mmap_resource_type)) {
        AVM_ABORT();
    }
}

void sys_free_platform(GlobalContext *glb)
{
    struct ESP32PlatformData *platform = glb->platform_data;
    platform->select_thread_exit = true;
    select_thread_signal(platform);
    pthread_join(platform->select_thread, NULL);
    close(platform->signal_fd);
    if (platform->eventfd_registered) {
        if (UNLIKELY(esp_vfs_eventfd_unregister() != ESP_OK)) {
            fprintf(stderr, "Cannot unregister eventfd\n");
            AVM_ABORT();
        }
    }

    if (platform->random_is_initialized) {
        mbedtls_ctr_drbg_free(&platform->random_ctx);
    }

    if (platform->entropy_is_initialized) {
        mbedtls_entropy_free(&platform->entropy_ctx);
    }

#ifndef AVM_NO_SMP
    smp_mutex_destroy(platform->entropy_mutex);
    smp_mutex_destroy(platform->random_mutex);
#endif

    free(platform);
}

#if !defined(CONFIG_IDF_TARGET_ARCH_RISCV) && !defined(AVM_NO_JIT)
struct xtensa_part_mapping {
    uintptr_t dbus_base;
    uintptr_t ibus_base;
    size_t size;
    spi_flash_mmap_handle_t ibus_handle;
};
static struct xtensa_part_mapping *s_xtensa_part_mappings = NULL;
static int s_xtensa_part_count = 0;
// Protects s_xtensa_part_mappings and s_xtensa_part_count. Reachable from
// any scheduler thread via sys_open_avm_from_file / sys_map_native_code.
static pthread_mutex_t s_xtensa_part_mutex = PTHREAD_MUTEX_INITIALIZER;
#endif

const void *esp32_sys_mmap_partition(const char *partition_name, spi_flash_mmap_handle_t *handle, int *size)
{
    const esp_partition_t *partition = esp_partition_find_first(ESP_PARTITION_TYPE_DATA,
        ESP_PARTITION_SUBTYPE_ANY, partition_name);
    if (!partition) {
        ESP_LOGW(TAG, "AVM partition not found for %s", partition_name);
        *size = 0;
        return NULL;
    } else {
        *size = partition->size;
    }

    const void *mapped_memory;
    if (esp_partition_mmap(partition, 0, partition->size, SPI_FLASH_MMAP_DATA, &mapped_memory,
            handle)
        != ESP_OK) {
        ESP_LOGE(TAG, "Failed to map BEAM partition for %s", partition_name);
        return NULL;
    }
    ESP_LOGI(TAG, "Loaded BEAM partition %s at address 0x%"PRIx32" (size=%"PRIu32" bytes)",
        partition_name, partition->address, partition->size);

#ifndef CONFIG_IDF_TARGET_ARCH_RISCV
    // On Xtensa, flash DROM is not executable. Map each AVM partition via the
    // instruction bus (IBUS) as well so that AOT native code chunks can be
    // executed directly from flash. Handles are kept alive for the VM lifetime.
    // We store (dbus_base, ibus_base, size) so sys_map_native_code can convert
    // DBUS addresses to IBUS addresses by direct offset arithmetic rather than
    // relying on spi_flash_phys2cache which fails on LX6 even after a successful IBUS mmap.
#ifndef AVM_NO_JIT
    {
        const void *ibus_ptr;
        spi_flash_mmap_handle_t ibus_handle;
        if (esp_partition_mmap(partition, 0, partition->size, SPI_FLASH_MMAP_INST,
                &ibus_ptr, &ibus_handle) == ESP_OK) {
            pthread_mutex_lock(&s_xtensa_part_mutex);
            struct xtensa_part_mapping *new_mappings = realloc(s_xtensa_part_mappings,
                (s_xtensa_part_count + 1) * sizeof(struct xtensa_part_mapping));
            if (IS_NULL_PTR(new_mappings)) {
                pthread_mutex_unlock(&s_xtensa_part_mutex);
                spi_flash_munmap(ibus_handle);
                ESP_LOGW(TAG, "Failed to allocate IBUS mapping entry for %s", partition_name);
            } else {
                s_xtensa_part_mappings = new_mappings;
                s_xtensa_part_mappings[s_xtensa_part_count].dbus_base = (uintptr_t) mapped_memory;
                s_xtensa_part_mappings[s_xtensa_part_count].ibus_base = (uintptr_t) ibus_ptr;
                s_xtensa_part_mappings[s_xtensa_part_count].size = partition->size;
                s_xtensa_part_mappings[s_xtensa_part_count].ibus_handle = ibus_handle;
                s_xtensa_part_count++;
                pthread_mutex_unlock(&s_xtensa_part_mutex);
            }
        } else {
            ESP_LOGW(TAG, "Failed to map partition %s for instruction access", partition_name);
        }
    }
#endif // AVM_NO_JIT
#endif // CONFIG_IDF_TARGET_ARCH_RISCV

    return mapped_memory;
}

struct ESP32PartAVMPack
{
    struct AVMPackData base;
    spi_flash_mmap_handle_t part_handle;
};

static void esp32_part_avm_pack_destructor(struct AVMPackData *obj, GlobalContext *global);

static const struct AVMPackInfo esp32_part_avm_pack_info = {
    .destructor = esp32_part_avm_pack_destructor
};

static void esp32_part_avm_pack_destructor(struct AVMPackData *obj, GlobalContext *global)
{
    UNUSED(global);

    struct ESP32PartAVMPack *part_avm = CONTAINER_OF(obj, struct ESP32PartAVMPack, base);
    spi_flash_munmap(part_avm->part_handle);
    free(obj);
}

enum OpenAVMResult sys_open_avm_from_file(GlobalContext *global, const char *path, struct AVMPackData **data)
{
    TRACE("sys_open_avm_from_file: Going to open: %s\n", path);

    const char *const parts_by_name = "/dev/partition/by-name/";
    int parts_by_name_len = strlen(parts_by_name);

    struct AVMPackData *avmpack_data = NULL;
    if (!strncmp(path, parts_by_name, parts_by_name_len)) {
        spi_flash_mmap_handle_t part_handle;
        int size;
        const char *part_name = path + parts_by_name_len;
        const esp_partition_t *partition = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, part_name);
        if (!partition) {
            ESP_LOGW(TAG, "AVM partition not found for %s", part_name);
            return AVM_OPEN_CANNOT_OPEN;
        }
        size = partition->size;

