atomvm/AtomVM/src/platforms/esp32/components/avm_sys/sys.c
int sys_mbedtls_entropy_func(void *entropy, unsigned char *buf, size_t size)
{
#if !defined(MBEDTLS_THREADING_C) && !defined(AVM_NO_SMP)
    struct ESP32PlatformData *platform
        = CONTAINER_OF(entropy, struct ESP32PlatformData, entropy_ctx);
    SMP_MUTEX_LOCK(platform->entropy_mutex);
    int result = mbedtls_entropy_func(entropy, buf, size);
    SMP_MUTEX_UNLOCK(platform->entropy_mutex);

    return result;
#else
    return mbedtls_entropy_func(entropy, buf, size);
#endif
}

mbedtls_entropy_context *sys_mbedtls_get_entropy_context_lock(GlobalContext *global)
{
    struct ESP32PlatformData *platform = global->platform_data;

    SMP_MUTEX_LOCK(platform->entropy_mutex);

    if (!platform->entropy_is_initialized) {
        // mbedtls_entropy_init will gather entropy for us using esp_fill_random()
        // however it will be pseudorandom when wifi/bluetooth/RF is not enabled.
        //
        // WARNING: when RF is off, esp_fill_random() output is NOT cryptographically
        // secure.  All operations that depend on this CSPRNG (strong_rand_bytes,
        // generate_key, ECDSA signing) will use weak entropy.  Predictable ECDSA
        // nonces can lead to private key recovery.
        //
        // TODO: when radio is not active bootloader_random_enable() must be enabled for gathering
        // entropy. However, "enable function is not safe to use if any other subsystem is
        // accessing the RF subsystem or the ADC at the same time".
        mbedtls_entropy_init(&platform->entropy_ctx);
        platform->entropy_is_initialized = true;
    }

    return &platform->entropy_ctx;
}

void sys_mbedtls_entropy_context_unlock(GlobalContext *global)
{
#ifndef AVM_NO_SMP
    struct ESP32PlatformData *platform = global->platform_data;
    SMP_MUTEX_UNLOCK(platform->entropy_mutex);
#else
    UNUSED(global);
#endif
}

mbedtls_ctr_drbg_context *sys_mbedtls_get_ctr_drbg_context_lock(GlobalContext *global)
{
    struct ESP32PlatformData *platform = global->platform_data;

    SMP_MUTEX_LOCK(platform->random_mutex);

    if (!platform->random_is_initialized) {
        mbedtls_ctr_drbg_init(&platform->random_ctx);

        mbedtls_entropy_context *entropy_ctx = sys_mbedtls_get_entropy_context_lock(global);
        // Safe to unlock it now, sys_mbedtls_entropy_func will lock it again later
        sys_mbedtls_entropy_context_unlock(global);

        const char *seed = "AtomVM ESP32 Mbed-TLS initial seed.";
        int seed_len = strlen(seed);
        int seed_err = mbedtls_ctr_drbg_seed(&platform->random_ctx, sys_mbedtls_entropy_func,
            entropy_ctx, (const unsigned char *) seed, seed_len);
        if (UNLIKELY(seed_err != 0)) {
            abort();
        }
        platform->random_is_initialized = true;
    }

    return &platform->random_ctx;
}

void sys_mbedtls_ctr_drbg_context_unlock(GlobalContext *global)
{
#ifndef AVM_NO_SMP
    struct ESP32PlatformData *platform = global->platform_data;
    SMP_MUTEX_UNLOCK(platform->random_mutex);
#else
    UNUSED(global);
#endif
}

#ifndef AVM_NO_JIT
#include <soc/soc.h>

ModuleNativeEntryPoint sys_map_native_code(const uint8_t *code, size_t code_size)
{
    uintptr_t addr = (uintptr_t) code;

#if defined(CONFIG_IDF_TARGET_ARCH_RISCV)
    UNUSED(code_size);
    // On RISC-V ESP32 targets, native code in flash needs to be accessed
    // through the instruction cache (IROM) not data cache (DROM)
#if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C2)
    // ESP32-C3 and C2 have separate DROM and IROM regions
    if (addr >= SOC_DROM_LOW && addr < SOC_DROM_HIGH) {
        // Convert from data cache address to instruction cache address
        addr = addr - SOC_DROM_LOW + SOC_IROM_LOW;
    }
#endif
    // ESP32-C6, H2, and P4 have unified DROM/IROM, no conversion needed
#else
    // On Xtensa, DROM (0x3F4xxxxx) is not executable. Convert to the IBUS
    // address by finding the partition whose DBUS window contains addr and
    // computing the offset into its IBUS window. This is more reliable than
    // spi_flash_phys2cache which fails on LX6 even after a successful IBUS mmap.
    pthread_mutex_lock(&s_xtensa_part_mutex);
    for (int i = 0; i < s_xtensa_part_count; i++) {
        uintptr_t dbus_base = s_xtensa_part_mappings[i].dbus_base;
        size_t mapping_size = s_xtensa_part_mappings[i].size;
        if (addr >= dbus_base && (addr + code_size) <= (dbus_base + mapping_size)) {
            addr = s_xtensa_part_mappings[i].ibus_base + (addr - dbus_base);
            break;
        }
    }
    pthread_mutex_unlock(&s_xtensa_part_mutex);
    // If addr is still in DROM, no partition mapping was found. Fall back to
    // on-demand spi_flash_mmap(INST) for native code embedded in the app ELF
    // binary (e.g. via _binary_xxx_start / ConstAVMPack in the test harness).
    // Failure to install an IBUS mapping returns NULL so the caller falls back
    // to interpreted mode rather than jumping to a non-executable DROM address.
    if (addr >= SOC_DROM_LOW && addr < SOC_DROM_HIGH) {
        size_t phys_addr = spi_flash_cache2phys((void *) addr);
        if (phys_addr == SPI_FLASH_CACHE2PHYS_FAIL) {
            ESP_LOGE(TAG, "spi_flash_cache2phys failed for 0x%" PRIx32, (uint32_t) addr);
            return NULL;
        }
        size_t page_size = SPI_FLASH_MMU_PAGE_SIZE;
        size_t phys_page_base = phys_addr & ~(page_size - 1);
        size_t offset_in_page = phys_addr - phys_page_base;
        size_t map_size = (offset_in_page + code_size + page_size - 1) & ~(page_size - 1);
        const void *ibus_ptr;
        spi_flash_mmap_handle_t ibus_handle;
        if (spi_flash_mmap(phys_page_base, map_size, SPI_FLASH_MMAP_INST, &ibus_ptr, &ibus_handle) != ESP_OK) {
            ESP_LOGE(TAG, "spi_flash_mmap(INST) failed for 0x%" PRIx32, (uint32_t) addr);
            return NULL;
        }
        pthread_mutex_lock(&s_xtensa_part_mutex);
        struct xtensa_part_mapping *new_mappings = realloc(s_xtensa_part_mappings,
            (s_xtensa_part_count + 1) * sizeof(struct xtensa_part_mapping));
        if (IS_NULL_PTR(new_mappings)) {
            pthread_mutex_unlock(&s_xtensa_part_mutex);
            spi_flash_munmap(ibus_handle);
            ESP_LOGE(TAG, "Failed to alloc IBUS mapping for embedded native code");
            return NULL;
        }
        uintptr_t dbus_page_base = addr & ~((uintptr_t) (page_size - 1));
        s_xtensa_part_mappings = new_mappings;
        s_xtensa_part_mappings[s_xtensa_part_count].dbus_base = dbus_page_base;
        s_xtensa_part_mappings[s_xtensa_part_count].ibus_base = (uintptr_t) ibus_ptr;
        s_xtensa_part_mappings[s_xtensa_part_count].size = map_size;
        s_xtensa_part_mappings[s_xtensa_part_count].ibus_handle = ibus_handle;
        s_xtensa_part_count++;
        pthread_mutex_unlock(&s_xtensa_part_mutex);
        addr = (uintptr_t) ibus_ptr + offset_in_page;
    }
#endif

    return (ModuleNativeEntryPoint) addr;
}

void sys_release_native_code(ModuleNativeEntryPoint entry_point)
{
    // Native code points into flash; nothing to free
    UNUSED(entry_point);
}
#endif
